[
    {
        "name": "sales",
        "base": false,
        "description": "emails about deals, product or services inquiries, follow-ups, objections, meetings, and closing business. EXCLUDES: job opportunities, position offers, recruitment, hiring, or staffing-related emails.",
        "intent": "The sender is either: (1) selling a product or service to the recipient (sales rep/seller perspective), or (2) inquiring about, negotiating, or following up on a product or service purchase (customer/buyer perspective). Consider their approach: selling side - cold outreach, follow-up, offering discount, value proposition, or closing; buying side - product inquiry, price negotiation, deal follow-up, contract questions, or purchase decision. IMPORTANT: This does NOT include job positions, employment opportunities, recruitment, hiring, or staffing - those are separate categories.",
        "userIntent": "I am engaging in a sales-related conversation, either as a seller reaching out to prospects to generate interest and drive deals, or as a customer inquiring about products/services, negotiating terms, following up on deals, or making purchase decisions.",
        "roleDescription": "a professional sales or procurement email writer",
        "contextSpecific": "If the sender is selling: respond as a potential customer evaluating the offer. Consider: pricing, value proposition, fit with your needs, and next steps. Use variants that match your interest level and decision-making stage. If the sender is a customer inquiring: respond as the seller/vendor. Consider: addressing their questions, providing information, negotiating terms, and guiding them toward a purchase decision. NOTE: This context is for product/service sales only - NOT for job opportunities or employment offers."
    },
    {
        "name": "recruitment",
        "base": false,
        "description": "Use this package when YOU are a recruiter or hiring manager drafting NEW emails. You are reaching out to candidates to introduce job opportunities, conduct interviews, extend offers, or follow up on the hiring process. This package is for when YOU are actively recruiting and seeking to attract, evaluate, or hire talent.",
        "intent": "The sender is a job seeker applying to or following up with the recipient. Consider their intent: expressing interest in a role, attaching resume, requesting interview, thanking after meeting, or seeking referrals.",
        "userIntent": "I am reaching out to a potential candidate to introduce an opportunity, gauge interest, or progress the hiring process, aiming to attract and secure top talent.",
        "roleDescription": "a hiring manager or recruiter responding to a job application",
        "contextSpecific": "The sender is applying for a position. Respond as the recipient (hiring manager/recruiter). Consider: candidate qualifications, fit with role requirements, next steps in hiring process, and providing constructive feedback if declining."
    },
    {
        "name": "jobseeker",
        "base": false,
        "description": "Use this package when YOU are a job seeker or candidate drafting NEW emails. You are reaching out to employers, recruiters, or contacts to apply for positions, submit resumes, express interest in roles, follow up on applications, or network for job opportunities. This package is for when YOU are actively job searching and seeking employment.",
        "intent": "The sender is a recruiter offering a job position or opportunity to the recipient. Consider what they're offering: specific role details, interview invitation, salary range, company culture fit, or next steps in hiring process.",
        "userIntent": "I am initiating contact with a potential employer or contact to express interest in a role, showcase my qualifications, or follow up on an application, with the goal of advancing my job search.",
        "roleDescription": "a professional candidate responding to a recruiter's job offer",
        "contextSpecific": "The sender is a recruiter or hiring manager offering a job position to you. Respond as the recipient (candidate). Consider: your interest in the role, questions about the position/company/compensation, expressing interest or declining, and next steps in your application process."
    },
    {
        "name": "support",
        "base": false,
        "description": "emails about customer issues, complaints, troubleshooting, and resolutions",
        "intent": "The sender is either: (1) seeking help or reporting an issue to the recipient (customer perspective), or (2) providing support, assistance, or resolution to the recipient (support desk perspective). Consider the problem: technical bug, billing inquiry, feature request, service complaint, or follow-up, and urgency level.",
        "userIntent": "I am contacting support to report an issue, request assistance, or seek resolution, aiming to get quick, helpful guidance while maintaining a professional tone.",
        "roleDescription": "a professional customer support specialist or customer seeking support",
        "contextSpecific": "If the sender is a customer: respond as the support desk - address their concern professionally and helpfully. Consider: urgency, impact, resolution options, escalation needs, and customer satisfaction. Provide clear next steps and timelines. If the sender is support: respond as the customer - acknowledge the response, ask clarifying questions if needed, provide additional information, or confirm resolution."
    },
    {
        "name": "networking",
        "base": false,
        "description": "emails about professional connections, introductions, referrals, and collaborations",
        "intent": "The sender is building or maintaining a professional relationship with the recipient. Consider the goal: warm introduction, referral request, collaboration proposal, or staying in touch after event.",
        "userIntent": "I am reaching out to a professional contact to build rapport, seek advice, request a referral, or propose collaboration, with the aim of expanding my network.",
        "roleDescription": "a professional building genuine connections",
        "contextSpecific": "Build a meaningful professional relationship. Consider: mutual value, relationship building, reciprocity, and long-term connection. Keep it professional, warm, and relationship-focused."
    },
    {
        "name": "generic",
        "base": true,
        "description": "general professional emails not fitting specific categories",
        "intent": "The sender has a neutral professional intent toward the recipient. Consider basic goals like information sharing, scheduling, or simple acknowledgments without strong sales/hiring/support elements.",
        "userIntent": "I am sending a general professional email to share information, schedule a meeting, or acknowledge something, without a specific sales, hiring, or support agenda.",
        "roleDescription": "a professional email reply writer",
        "contextSpecific": "Carefully analyze the source email to understand the context, relationship, and intent. Respond appropriately from the recipient's perspective, considering the specific situation and relationship dynamics."
    }
]